13/data/attachments/c260f15ec157c038.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_3c8a0704-8b02-4096-98b0-98a5ba4016fe</nif:username>
            <nif:friendToBeAdded>Jeremy_thing_Friend_65857_8</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>